In [1]:
import pandas as pd

In [2]:
import numpy as np

In [3]:
budget_data = pd.read_csv('budget_data.txt')

In [4]:
budget_data

        Date  Profit/Losses
0   Jan-2010         867884
1   Feb-2010         984655
2   Mar-2010         322013
3   Apr-2010         -69417
4   May-2010         310503
..       ...            ...
81  Oct-2016         102685
82  Nov-2016         795914
83  Dec-2016          60988
84  Jan-2017         138230
85  Feb-2017         671099

[86 rows x 2 columns]

In [5]:
dates = list(budget_data['Date'])

In [6]:
pnl = list(budget_data['Profit/Losses'])

In [7]:
total_months = len(dates)

In [8]:
print(f"${sum(pnl)}")

$38382578

In [9]:
def pnl_change(old_pnl,new_pnl):
    return new_pnl - old_pnl

In [10]:
daily_change = []

for i in range(0,len(pnl)-1):
    output = pnl_change(pnl[i],pnl[i+1])
    daily_change.append(output)

In [ ]:
daily_change

In [ ]:
daily_change

In [13]:
avg_change = round(sum(daily_change) / len(daily_change),2)

In [14]:
avg_change

-2315.12

In [15]:
max(daily_change)

1926159

In [16]:
min(daily_change)

-2196167

In [17]:
daily_change.insert(0,'')

In [18]:
len(daily_change)

86

In [19]:
change_df = pd.DataFrame({'Date':dates,'Change':daily_change})

In [20]:
change_df

        Date   Change
0   Jan-2010
1   Feb-2010   116771
2   Mar-2010  -662642
3   Apr-2010  -391430
4   May-2010   379920
..       ...      ...
81  Oct-2016  -665765
82  Nov-2016   693229
83  Dec-2016  -734926
84  Jan-2017    77242
85  Feb-2017   532869

[86 rows x 2 columns]

In [23]:
change_df['Change'] = pd.to_numeric(change_df['Change'])

In [26]:
change_df.loc[change_df['Change'].idxmax()]

Date       Feb-2012
Change    1926159.0
Name: 25, dtype: object

In [28]:
max_change = change_df[change_df.Change == change_df.Change.max()]

In [29]:
max_change

        Date     Change
25  Feb-2012  1926159.0

In [30]:
min_change = change_df[change_df.Change == change_df.Change.min()]

In [31]:
min_change

        Date     Change
44  Sep-2013 -2196167.0

In [56]:
print(f"Financial Analysis\n-------------------------------\nTotal Months: {total_months}")
print(f"Total PnL: ${sum(pnl)}")
print(f"Average Change: ${avg_change}")
print(f"Greatest increase in profits: \n{max_change}")

print(f"\nGreatest decrease in profits:\n{min_change}")

Financial Analysis
-------------------------------
Total Months: 86
Total PnL: $38382578
Average Change: $-2315.12
Greatest increase in profits:
        Date     Change
25  Feb-2012  1926159.0

Greatest decrease in profits:
        Date     Change
44  Sep-2013 -2196167.0